УТ_11_4.Umico/src/InformationRegisters/UMC_ИдентификаторыЧековUmico/UMC_ИдентификаторыЧековUmico.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>UMC_ИдентификаторыЧековUmico</name>
  <resources>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.РеализацияУслугПрочихАктивов</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ЧекККМВозврат</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_11_4.Umico/src/CommonModules/UMC_ОбменСUmico/Module.bsl
// @strict-types
#Область СлужебныеПроцедурыИФункции

#Область Общее

// Получить статус обмена с Umico.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения:
//  * UMC_СтатусПередачиВUmico - Строка
//	Документ - ДокументСсылка.ЧекККМ,ДокументСсылка.ЧекККМВозврат,ДокументСсылка.РеализацияТоваровУслуг,ДокументСсылка.ВозвратТоваровОтКлиента
Процедура ПолучитьСтатусОбменаСUmico(Форма, Документ) Экспорт
	
	Выборка = ПолучитьВыборкуПоСтатусуДокумента(Документ);
		
	Если Выборка.Следующий() Тогда
		Если НРег(Выборка.Статус) = "paid" Тогда
			Форма.UMC_СтатусПередачиВUmico = СтрШаблон(НСтр("ru = 'Документ успешно передан в Umico. Статус: %1'"), Выборка.Статус);
			Форма.Элементы.UMC_СтатусПередачиВUmico.ЦветТекста = ЦветаСтиля.ЦветАкцента;	
		Иначе
			Форма.UMC_СтатусПередачиВUmico = СтрШаблон(НСтр("ru = 'Документ передан в Umico. Статус: %1'"), Выборка.Статус);
			Форма.Элементы.UMC_СтатусПередачиВUmico.ЦветТекста = ЦветаСтиля.ТекстИнформационнойНадписи;	
		КонецЕсли;	
	Иначе
		Форма.UMC_СтатусПередачиВUmico = НСтр("ru = 'Нет сведений об обмене с Umico'");
		Форма.Элементы.UMC_СтатусПередачиВUmico.ЦветТекста = ЦветаСтиля.ДосьеВторостепеннаяНадписьЦвет;
	КонецЕсли;
	
КонецПроцедуры

// Получить выборку по статусу документа.
// 
// Параметры:
//  Документ - ДокументСсылка.ЧекККМ, ДокументСсылка.ЧекККМВозврат, ДокументСсылка.РеализацияТоваровУслуг, ДокументСсылка.ВозвратТоваровОтКлиента - Документ
// 
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса:
//	* Статус - Строка - Строка
Функция ПолучитьВыборкуПоСтатусуДокумента(Документ)

	Запрос = Новый Запрос("ВЫБРАТЬ
	|	UMC_ИдентификаторыЧековUmico.Статус
	|ИЗ
	|	РегистрСведений.UMC_ИдентификаторыЧековUmico КАК UMC_ИдентификаторыЧековUmico
	|ГДЕ
	|	UMC_ИдентификаторыЧековUmico.Документ = &Документ");
	Запрос.УстановитьПараметр("Документ", Документ);
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

#КонецОбласти
	
#Область ТипизирующиеФункции

// Новая структура JSON Balance.
// 
// Возвращаемое значение:
//  Структура - Новая структура JSON Balance:
// * available_points - Число -
Функция НоваяСтруктураJSONBalance() Экспорт

	Структура = Новый Структура;
	Структура.Вставить("available_points", 0);

	Возврат Структура;

КонецФункции

// Новая структура JSON Refund.
// 
// Возвращаемое значение:
//  Структура - Новая структура JSON Refund:
// * refund_ext_id - Строка -
// * accrued_points - Число -
Функция НоваяСтруктураJSONRefund() Экспорт

	Структура = Новый Структура;
	Структура.Вставить("refund_ext_id", "");
	Структура.Вставить("accrued_points", 0);

	Возврат Структура;

КонецФункции

// Новая структура JSON Checkout.
// 
// Возвращаемое значение:
//  Структура - Новая структура JSON Checkout:
// * order_ext_id - Строка -
Функция НоваяСтруктураJSONCheckout() Экспорт

	Структура = Новый Структура;
	Структура.Вставить("order_ext_id", "");

	Возврат Структура;

КонецФункции

// Новая структура JSON Status.
// 
// Возвращаемое значение:
//  Структура - Новая структура JSON Status:
// * status - Строка -
Функция НоваяСтруктураJSONStatus() Экспорт

	Структура = Новый Структура;
	Структура.Вставить("status", "");

	Возврат Структура;

КонецФункции

// Новая структура сведения о карте.
// 
// Возвращаемое значение:
//  Структура - Новая структура сведения о карте:
// * Результат - Булево -
// * Сумма - Число -
// * ТекстОшибки - Строка -
Функция НоваяСтруктураСведенияОКартеUmico() Экспорт

	Возврат Новый Структура("Результат, Сумма, ТекстОшибки", Ложь, 0, "");

КонецФункции

// Новая структура данные регистрации чека.
// 
// Возвращаемое значение:
//  Структура - Новая структура сведения о карте:
// * Результат - Булево -
// * Идентификатор - Строка -
// * ТекстОшибки - Строка -
Функция НоваяСтруктураДанныеРегистрацииЧекаUmico() Экспорт

	Возврат Новый Структура("Результат, Идентификатор, ТекстОшибки", Ложь, "", "");

КонецФункции

// Новая структура данные регистрации чека возврата.
// 
// Возвращаемое значение:
//  Структура - Новая структура сведения о карте:
// * Результат - Булево -
// * Идентификатор - Строка -
// * СуммаБалловКВозврату - Число -
// * ТекстОшибки - Строка -
Функция НоваяСтруктураДанныеРегистрацииЧекаВозвратаUmico() Экспорт

	Структура = Новый Структура;

	Структура.Вставить("Результат", Ложь);
	Структура.Вставить("Идентификатор", ""); 
	Структура.Вставить("СуммаБалловКВозврату", 0); 
	Структура.Вставить("ТекстОшибки", "");

	Возврат Структура;

КонецФункции

// Новая структура статус чека.
// 
// Возвращаемое значение:
//  Структура - Новая структура статус чека:
// * Результат - Булево -
// * Ожидание - Булево -
// * ТекстОшибки - Строка -
Функция НоваяСтруктураСтатусЧекаUmico() Экспорт

	Возврат Новый Структура("Результат, Ожидание, ТекстОшибки", Ложь, Ложь, "");

КонецФункции

// Новая структура ОтветHTTPЗапроса.
// 
// Возвращаемое значение:
//  Структура - Имя функции:
// * Результат - Булево -
// * ТелоОтвета - Строка -
// * Ожидание - Булево -
// * ТекстОшибки - Строка -
Функция НоваяСтруктураОтветHTTPЗапроса() Экспорт

	Структура = Новый Структура;
	Структура.Вставить("Результат", Ложь);
	Структура.Вставить("ТелоОтвета", "");
	Структура.Вставить("Ожидание", Ложь);
	Структура.Вставить("ТекстОшибки", "");

	Возврат Структура;

КонецФункции

// Новая структура результат ввода карты Umico.
// 
// Возвращаемое значение:
//  Структура - Новая структура результат ввода карты Umico:
// * НомерКарты - Строка -
// * Сумма - Число -
Функция НоваяСтруктураРезультатВводаКартыUmico() Экспорт
	
	Возврат Новый Структура("НомерКарты, Сумма", "", 0);
	
КонецФункции

// Новая структура результат регистрации чека в Umico.
// 
// Возвращаемое значение:
//  Структура - Новая структура результат регистрации чека в Umico:
// * Результат - Булево -
// * ТекстОшибки - Строка -
Функция НоваяСтруктураРезультатРегистрацииЧекаВUmico() Экспорт
	
	Возврат Новый Структура("Результат, ТекстОшибки", Ложь, "");
	
КонецФункции

// Новая структура товар чека Umico.
// 
// Возвращаемое значение:
//  Структура - Новая структура товар чека Umico:
// * item_number - Число -
// * product_id - Строка -
// * product_group_id - Строка -
// * quantity - Число -
// * price - Строка -
// * amount_before_promo - Строка -
// * amount_after_promo - Строка -
// * promo_discount_pct - Число -
// * desc_text - Строка -
Функция НоваяСтруктураТоварЧекаUmico() Экспорт
	
	Структура = Новый Структура;
	
	Структура.Вставить("item_number", 0);
	Структура.Вставить("product_id", "");
	Структура.Вставить("product_group_id", "");
	Структура.Вставить("quantity", 0); 
	Структура.Вставить("price", ""); 
	Структура.Вставить("amount_before_promo", ""); 
	Структура.Вставить("amount_after_promo", ""); 
	Структура.Вставить("promo_discount_pct", 0); 
	Структура.Вставить("desc_text", "");
					
	Возврат Структура;
	
КонецФункции

// Новая структура товар чека возврата Umico.
// 
// Возвращаемое значение:
//  Структура - Новая структура товар чека возврата Umico:
// * item_number - Число -
// * product_id - Строка -
// * product_group_id - Строка -
// * quantity - Число -
// * order_item_number - Число -
// * refund_amount - Число -
// * desc_text - Строка -
Функция НоваяСтруктураТоварЧекаВозвратаUmico() Экспорт
	
	Структура = Новый Структура;
	
	Структура.Вставить("item_number", 0);
	Структура.Вставить("product_id", "");
	Структура.Вставить("product_group_id", "");
	Структура.Вставить("quantity", 0); 
	Структура.Вставить("order_item_number", 0);
	Структура.Вставить("refund_amount", 0);
	Структура.Вставить("desc_text", "");
					
	Возврат Структура;
	
КонецФункции

// Новая структура заполнения списания.
// 
// Возвращаемое значение:
//  Структура - Новая структура заполнения списания:
// * СписаниеЗаСчетUmico - Булево -
// * Основание - Неопределено, ДокументСсылка.РеализацияТоваровУслуг, ДокументСсылка.ВозвратТоваровОтКлиента -
Функция НоваяСтруктураЗаполненияСписания() Экспорт
	
	Структура = Новый Структура;
	Структура.Вставить("СписаниеЗаСчетUmico", Ложь);
	Структура.Вставить("Основание", Неопределено);
	
	Возврат Структура;
	
КонецФункции

#КонецОбласти

#Область Прочее

Функция ПолучитьТекстОшибкиНеОпределеныПараметрыПодключения() Экспорт
	
	Возврат НСтр("ru = 'Не определены параметры подключения к Umico. Пожалуйста, обратитесь к администратору'");
	
КонецФункции

#КонецОбласти

#КонецОбласти
